#include "upvs_err.h"

// public
s32_t upvs_err__add_item(err_cell_t *, u32_t, bool, s32_t);
// static
static s32_t get_free_pos(upvs_err_t *);

/**	----------------------------------------------------------------------------
	* @brief ??? */
void *
  upvs_err__create() {
/*----------------------------------------------------------------------------*/
 
  return (void *)0;
}

/**	----------------------------------------------------------------------------
	* @brief ??? */
int
  upvs_err__init(void *arg) {
/*----------------------------------------------------------------------------*/
 
  return 0;
}

/**	----------------------------------------------------------------------------
	* @brief ???
	* @retval error: Статус выполнения функции. */
s32_t
  upvs_err__add_item(err_cell_t *self, u32_t code, bool state, s32_t value) {
/*----------------------------------------------------------------------------*/
	if (!px) return -1;
  
  // Считаем, что пока state==1 авария авктивна и делаем запрос к БД добавить
  // новую запись с кодом 'code' и значением 'value'.
  // Считаем, что авария устранена если state==0 и удаляем запись
  if (state)
    errdb_query_insert(px, code, value);
  else
    errdb_query_remove(px, code, value);
  
	return 0;
}

/**	----------------------------------------------------------------------------
	* @brief ???
	* @retval error: Статус выполнения функции. */
static s32_t
  get_free_pos(upvs_err_t *self) {
/*----------------------------------------------------------------------------*/
	if (!self) return -1;
  for (uint8_t i = 0; i < ERR_CAPACITY; i++) {
		if (self->axCells[i].ulCode == 0) {
      return (int)i;
    }
	}
	return -1;
}